// GetTlsValue SetTlsValue optimize?
// WaitForSingleObject WaitForMultipleObject



// Game.dll+36196b NEED FIX COLOR
// [Game.dll+AB6214]+7C0


extern "C"
{
#include "bcrypt.h"
}
#include <Windows.h>
#include <MinHook.h>
#include <string>
#include <algorithm>
#include <vector>
#include <regex>
#include "Storm.h"
#include "crc32.h"
#include "CustomFeatures.h"
#include "Antihack.h"
#include <VSyncHeader.h>
#include "warcis_reconnector.h"
#include <TlHelp32.h>
using namespace std;
#include <filesystem>
namespace fs = std::filesystem;

#include "WarcraftFrameHelper.h"
using namespace NWar3Frame;

#include "buffer.h"
#include "BlpReadWrite.h"


std::string LastUsername = "";
std::string LastPassword = "";



#pragma pack(push, 1)

struct StringRep {
	void**				vtable;		//0x0
	uint32_t			refCount;	//0x4
	uint32_t			unk_8;		//0x8
	uint32_t			list_C;		//0xC
	uint32_t			unk_10;		//0x10
	uint32_t			unk_14;		//0x14
	StringRep*			next;		//0x18
	char*				text;		//0x1C
};//sizeof = 0x20

struct RCString {
	void**				vtable;		//0x0
	uint32_t			unk_4;		//0x4
	StringRep*			stringRep;	//0x8
};//sizeof = 0xC


#pragma pack(pop)


void PrintText( const char * text, float staytime )
{
	if ( IsGame( ) )
	{
		int pPrintText2 = GameDll + 0x2F69A0;
		__asm
		{
			push - 1;
			push staytime;
			push text;
			mov ecx, pW3XGlobalClass;
			mov ecx, [ ecx ];
			mov eax, pPrintText2;
			call eax;
		}
	}
}


void PrintText( std::string strtext, float staytime )
{
	const char * text = strtext.c_str( );
	if ( IsGame( ) )
	{
		int pPrintText2 = GameDll + 0x2F69A0;
		__asm
		{
			push - 1;
			push staytime;
			push text;
			mov ecx, pW3XGlobalClass;
			mov ecx, [ ecx ];
			mov eax, pPrintText2;
			call eax;
		}
	}
}





void MakeGreenFix( )
{
#ifndef  ANTIHACKNODEBUG
	AddLogFunctionCall( __FUNCSIGW__ );
#endif
	int offset = GameDll + 0xAB6214;
	if ( offset )
	{
		offset = *( int* )offset;
		if ( offset )
		{
			*( int* )( offset + 0x7C0 ) = 0xFF00FF00;
		}
	}
}


bool CompareByteArray( PBYTE Data, PBYTE Signature )
{
#ifndef  ANTIHACKNODEBUG
